Repository: petarLits/book
Catalog: lib/l10n/app_*.arb
Languages: sr

# loginTitle
source: Sign in
sr: Ulogujte se

source: Welcome
sr: Dobrodosli

# loginSubtitle
source: Sign in to continue
sr: Ulogujte se da nastavite

# emptyEmail
source: Enter email
sr: Uneseti email

# emailError
source: Invalid email input
sr: Losa email forma

# emptyPassword
source: Enter password
sr: Unesite lozinku

source: Password
sr: Lozinka

# loginButton
source: Login
sr: Ulogujte se

# signUpButton
source: New user? Sign up
sr: Novi korisnik? Registrujte se

source: Register
sr: Registrujte se

source: First Name
sr: Ime

# emptyFirstName
source: Enter First Name
sr: Unesite ime

source: Last Name
sr: Prezime

# emptyLastName
source: Enter Last Name
sr: Unesite prezime

# passwordUppercaseError
source: Password must contain at least one uppercase letter
sr: Lozinka mora da sadrzi barem jedno veliko slovo

# passwordLowercaseError
source: Password must contain at least one lowercase letter
sr: Lozinka mora da sadrzi bare jedno malo slovo

# passwordNumericError
source: Password must contain at least one numeric character
sr: Lozinka mora da sadrzi barem jedan broj

# passwordSpecialCharacterError
source: Password must contain at least one special character
sr: Lozinka mora da sadrzi barem jedan specijalni karakter

# passwordLengthError
source: Password must be at least 8 characters long
sr: Lozinka mora da ima barem 8 karaktera

source: Confirm Password
sr: Potvrdite lozinku

# confirmPasswordError
source: Passwords are not matching
sr: Lozinke nisu iste

# registerButton
source: Register
sr: Registrujte se

# successfullyRegistered
source: You have been registered successfully
sr: Uspesno ste se registrovali

source: Invalid email
sr: Neispravan email

# serverError
source: Can not reach the server
sr: Server je nedostupan

# invalidCredentials
source: Invalid email or password
sr: Pogresan email ili lozinka

# newBookTitle
source: Title
sr: Naslov

# bookTitleError
source: Enter title
sr: Unesite naslov

# authorWithName
source: Author {bookAuthor}
sr: Autor {bookAuthor}

# authorLabel
source: Author
sr: Autor

# authorError
source: Enter author
sr: Unesite autora

# pickBookImage
source: Pick some image to add new book
sr: Izaberite sliku da dodate novu knjigu

# saveButton
source: SAVE
sr: SACUVAJ

source: Add new book
sr: Dodajte novu knjigu

# pickBook
source: Pick any book
sr: Izaberite knjigu

# singOutDialog
source: Are you sure you want to sign out?
sr: Da li ste sigurni da zelite da se odjavite?

source: Yes
sr: Da

source: No
sr: Ne

# leaveDialog
source: Are you sure you want to leave?
sr: Da li ste sigurni da zelite da napustite stranicu?

# changesWillBeDiscarded
source: All changes will be discarded
sr: Sve promene ce biti ponistene

# textLabel
source: Text
sr: Tekst

# textError
source: Enter some text
sr: Unesite tekst

# firstPage
source: Add first page
sr: Dodajte prvu stranicu
